In [1]:
import pandas as pd
df = pd.read_csv("weather_by_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [2]:
city=df.groupby("city")
city

In [3]:
city.count()

          day  temperature  windspeed  event
city
mumbai      4            4          4      4
new york    4            4          4      4
paris       4            4          4      4

In [6]:
city.size()

city
mumbai      4
new york    4
paris       4
dtype: int64

In [4]:
df.value_counts()

day       city      temperature  windspeed  event
1/1/2017  mumbai    90           5          Sunny     1
          new york  32           6          Rain      1
          paris     45           20         Sunny     1
1/2/2017  mumbai    85           12         Fog       1
          new york  36           7          Sunny     1
          paris     50           13         Cloudy    1
1/3/2017  mumbai    87           15         Fog       1
          new york  28           12         Snow      1
          paris     54           8          Cloudy    1
1/4/2017  mumbai    92           5          Rain      1
          new york  33           7          Sunny     1
          paris     42           10         Cloudy    1
dtype: int64

In [5]:
city.get_group("mumbai")

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [7]:
city.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [8]:
city.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

In [9]:
city.size()

city
mumbai      4
new york    4
paris       4
dtype: int64

In [15]:
data1={
    "id":[1,2,3,4,5,6,7,8,9],
    "country":["paris","us","russia","hyd","hyd","hyd","us","us","us"],
}


df1=pd.DataFrame(data1,index=["a","b","c","d","e","f","g","h","i"])
df1

   id country
a   1   paris
b   2      us
c   3  russia
d   4     hyd
e   5     hyd
f   6     hyd
g   7      us
h   8      us
i   9      us

# Differenece Between two DataFrames

In [26]:
r1={
    'id':[1,2,3,4,5,6],
    'names':["ram","raju","ramesh","vinay","vignesh","rohit"]
}
d1=pd.DataFrame(r1)


r2={
    'id':[1,2,3,4,5,6],
    'names':["ram","raju","ramesh","vinay","vignesh","babu"]
}
d1=pd.DataFrame(r1)
d2=pd.DataFrame(r2)

# res=pd.concat([d1,d2],ignore_index=True)
# res1=res.groupby("names")
# l=pd.concat([res1.get_group(n)      for n in res1.groups  if len(res1.get_group(n))==1  ])
# print(l)

res=pd.concat([d1,d2],ignore_index=True)
res1=res.groupby("names")
print([i for i in res1.groups    if len(res1.get_group(i))==1])

['babu', 'rohit']

In [25]:
# x=pd.merge(d1,d2,left_on="names",right_on="names",how="outer")
# x

x=pd.merge(d1,d2,left_on="names",right_on="names",how="outer")

   id_x    names  id_y
0   1.0      ram   1.0
1   2.0     raju   2.0
2   3.0   ramesh   3.0
3   4.0    vinay   4.0
4   5.0  vignesh   5.0
5   6.0    rohit   NaN
6   NaN     babu   6.0

In [31]:
# x[x.isna().any(axis=1)]["names"]
# x.loc[x.isna().any(axis=1),["names"]]

x[x.isna().any(axis=1)]["names"]

5    rohit
6     babu
Name: names, dtype: object

# Duplicates

In [23]:
r1={
    'id':[1,2,3,4,5,6],
    'names':["ram","ram","ram","vinay","vignesh","rohit"]
}
df1=pd.DataFrame(r1)
print(df1)
print()

# print(df1[~df1["names"].duplicated()])
# df1.drop_duplicates("names",inplace=True)

   id    names
0   1      ram
1   2      ram
2   3      ram
3   4    vinay
4   5  vignesh
5   6    rohit

In [47]:
df1

   id    names
0   1      ram
3   4    vinay
4   5  vignesh
5   6    rohit

In [51]:
import pandas as pd
d = {'City': ['Ahmedabad','Baroda','Anand',
              'Ahmedabad','Baroda','Anand'],
    'Temp':[40,35,32,45,37,34],
    'Humidity':[32,34,23,24,27,32]}
data = pd.DataFrame(d)
data

        City  Temp  Humidity
0  Ahmedabad    40        32
1     Baroda    35        34
2      Anand    32        23
3  Ahmedabad    45        24
4     Baroda    37        27
5      Anand    34        32

In [54]:
def Humidity_range(d1):
    if d1<25:
        return "low"
    elif d1>25 and d1<30:
        return "medium"
    else:
        return "high"
    
data["Humidity_Range"]=data["Humidity"].apply(temp_range)

In [55]:
data

        City  Temp  Humidity Humidity_Range
0  Ahmedabad    40        32         medium
1     Baroda    35        34         medium
2      Anand    32        23            low
3  Ahmedabad    45        24            low
4     Baroda    37        27         medium
5      Anand    34        32         medium

In [16]:
r1={
    'id':[1,2,3,4,5,6],
    'names':["ram","ram","ram","vinay","vignesh","rohit"]
}
df1=pd.DataFrame(r1)
print(df1)
print()

   id    names
0   1      ram
1   2      ram
2   3      ram
3   4    vinay
4   5  vignesh
5   6    rohit

In [24]:
import pandas as pd
d = {'City': ['Ahmedabad','Baroda','Anand',
              'Ahmedabad','Baroda','Anand'],
    'Temp':[40,35,32,45,37,34],
    'Humidity':[32,34,23,24,27,32]}
data = pd.DataFrame(d)
data

        City  Temp  Humidity
0  Ahmedabad    40        32
1     Baroda    35        34
2      Anand    32        23
3  Ahmedabad    45        24
4     Baroda    37        27
5      Anand    34        32

        City  Temp  Humidity humidity
0  Ahmedabad    40        32     high
1     Baroda    35        34     high
2      Anand    32        23     less
3  Ahmedabad    45        24     less
4     Baroda    37        27     high
5      Anand    34        32     high